<a href="https://colab.research.google.com/github/zack-murray/DS-Unit-3-Sprint-1-Software-Engineering/blob/master/module1-python-modules-packages-and-environments/LS_DS_311_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Import my mod
!pip install -i https://test.pypi.org/simple/ lambdata-zmurray

Looking in indexes: https://test.pypi.org/simple/
Collecting lambdata-zmurray
  Downloading https://test-files.pythonhosted.org/packages/19/45/37a5e46415eafd123215b9e250abbc24ecfd1016c621e48527d5e4fe92b2/lambdata_zmurray-1.1-py3-none-any.whl
Installing collected packages: lambdata-zmurray
Successfully installed lambdata-zmurray-1.1

In [0]:
import pandas as pd

#from my-mod import flto_nc and dato_cl
from my_lambdata.my_mod import flto_nc
from my_lambdata.my_mod import split_column_date

In [3]:
# Instantiate df to test mod.py
df = pd.DataFrame({"Friends":['Gene', 'Aaron', 'Dom', 'Scott', 'Zack'], 
"Times won setback":[3,1,2,0,5072],"First game won":['12-31-2012','2-13-2015',
                                                     '10-9-2008','5-6-2007','10-2-1991',]})

df.head()

  Friends  Times won setback First game won
0    Gene                  3     12-31-2012
1   Aaron                  1      2-13-2015
2     Dom                  2      10-9-2008
3   Scott                  0       5-6-2007
4    Zack               5072      10-2-1991

In [9]:
# Test 1st mod by splitting column date into multiple columns
df2 = split_column_date(df,'First game won')
df.head()

  Friends  Times won setback  ... First game won_day  listtocolumn
0    Gene                  3  ...                 31             5
1   Aaron                  1  ...                 13            10
2     Dom                  2  ...                  9            15
3   Scott                  0  ...                  6            20
4    Zack               5072  ...                  2            25

[5 rows x 7 columns]

In [0]:
# List also to test mod.py
l = [5,10,15,20,25]

In [8]:
flto_nc(df, l, 'listtocolumn')

df.head()

  Friends  Times won setback  ... First game won_day  listtocolumn
0    Gene                  3  ...                 31             5
1   Aaron                  1  ...                 13            10
2     Dom                  2  ...                  9            15
3   Scott                  0  ...                  6            20
4    Zack               5072  ...                  2            25

[5 rows x 7 columns]